



#################################   DEF ####################################

#
# def sum(name):
#     return f"{name} hello"
#
#
# print(sum('name'))
#
#
#
#
# def add_number(a, b):
#     return a + b
# result = add_number(2, 3)
# print(result)
#
#
# def add (a, v, b, c):
#     return a + v + b + c
#
#
#
# print(add(2, 2, 5, 5))
# print(add(1,3,5,2))
#

"""

задание на дам   def фунциясын колдонгула ичине for  цикл колдонгула и for менен 1 баштап 10 умножение аткарылсын 
      f  формат колдонуп жанына допалнительно x =  кылып кошумча чыксын

пример 

5 x 1 = 5
5 x 2 = 10
5 x 3 = 15

"""

"""                                           день практических задании


1 def функциясын колдонуп максимальный жана минимальный  листин ичиндеги  сандарды чыгаргыла

пример 

[2,4,6,78,23,9,1]

результат  max 78 min 1



2  задание 

    def  название бергиле переменно (n)
    for колдонгула или while   range ичине пример 1 баштап 10 чейин
    ошол ичиндеги менен перменно берилген санды умнажение операциясын аткарсын
    
    пример 
    
    функцияны чыкырганда(5)болсо  5 умножение болсун 
    
    5 x 1 = 5 
    5 x 2 = 10
    ушундай 10 чейин
    

"""
